// グラフの探索（幅優先）：すべての点を始点にした探索
#include <stdio.h>

#define N 8 // 点の数

int a[N+1][N+1] = {{0,0,0,0,0,0,0,0,0}, // 隣接行列
                   {0,0,1,0,0,0,0,0,0},
                   {0,1,0,1,1,1,0,0,0},
                   {0,0,1,0,0,0,0,1,0},
                   {0,0,1,0,0,0,0,0,0},
                   {0,0,1,0,0,0,1,0,0},
                   {0,0,0,0,0,1,0,1,1},
                   {0,0,0,1,0,0,1,0,1},
                   {0,0,0,0,0,0,1,1,0},};
int v[N+1]; // 訪問フラグ

int queue[100]; // キュー
int head,       // 先頭データのインデックス
    tail;       // 終端データのインデックス

int main(void) {
    int i, j, p;

    for (p = 1; p <= N; p++) {
        for (i = 1; i <= N; i++) {
            v[i] = 0;
        }
        head = tail = 0;
        queue[tail++] = p; v[p] = 1;
        do {
            i = queue[head++]; // キューから取り出す
            for (j = 1; j <= N; j++) {
                if (a[i][j] == 1 && v[j] == 0) {
                    printf("%d->%d ", i, j);
                    queue[tail++] = j; // キューに入れる
                    v[j] = 1;
                }
            }
        } while (head != tail);
        printf("\n");
    }

    return 0;
}
